m-gorecki/mynewt-nimble/nimble/drivers/nrf54l15/src/ble_phy.c
    ble_phy_trace_u32x2(BLE_PHY_TRACE_ID_START_TX, cputime, rem_usecs);

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_tx_phy_mode);
#endif

    /* XXX: This should not be necessary, but paranoia is good! */
    /* Clear timer0 compare to RXEN since we are transmitting */
    phy_ppi_timer0_compare0_to_radio_rxen_disable();

    if (ble_phy_set_start_time(cputime, rem_usecs, true) != 0) {
        STATS_INC(ble_phy_stats, tx_late);
        ble_phy_disable();
        rc = BLE_PHY_ERR_TX_LATE;
    } else {
        /* Enable PPI to automatically start TXEN */
        phy_ppi_timer0_compare0_to_radio_txen_enable();
        rc = 0;
    }

    return rc;
}

/**
 * Called to set the start time of a reception
 *
 * This function acts a bit differently than transmit. If we are late getting
 * here we will still attempt to receive.
 *
 * NOTE: care must be taken when calling this function. The channel should
 * already be set.
 *
 * @param cputime
 *
 * @return int
 */
int
ble_phy_rx_set_start_time(uint32_t cputime, uint8_t rem_usecs)
{
    bool late = false;
    int rc = 0;

    ble_phy_trace_u32x2(BLE_PHY_TRACE_ID_START_RX, cputime, rem_usecs);

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_rx_phy_mode);
#endif

    /* XXX: This should not be necessary, but paranoia is good! */
    /* Clear timer0 compare to TXEN since we are transmitting */
    phy_ppi_timer0_compare0_to_radio_txen_disable();

    if (ble_phy_set_start_time(cputime, rem_usecs, false) != 0) {
        STATS_INC(ble_phy_stats, rx_late);

        /* We're late so let's just try to start RX as soon as possible */
        ble_phy_set_start_now();

        late = true;
    }

    /* Enable PPI to automatically start RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_enable();

    /* Start rx */
    rc = ble_phy_rx();

    /*
     * If we enabled receiver but were late, let's return proper error code so
     * caller can handle this.
     */
    if (!rc && late) {
        rc = BLE_PHY_ERR_RX_LATE;
    }

    return rc;
}

int
ble_phy_tx(ble_phy_tx_pducb_t pducb, void *pducb_arg, uint8_t end_trans)
{
    int rc;
    uint8_t *dptr;
    uint8_t *pktptr;
    uint8_t payload_len;
    uint8_t hdr_byte;
    uint32_t state;
    uint32_t shortcuts;

    if (g_ble_phy_data.phy_transition_late) {
        ble_phy_disable();
        STATS_INC(ble_phy_stats, tx_late);
        return BLE_PHY_ERR_TX_LATE;
    }

    /*
     * This check is to make sure that the radio is not in a state where
     * it is moving to disabled state. If so, let it get there.
     */
    nrf_wait_disabled();

    /*
     * XXX: Although we may not have to do this here, I clear all the PPI
     * that should not be used when transmitting. Some of them are only enabled
     * if encryption and/or privacy is on, but I dont care. Better to be
     * paranoid, and if you are going to clear one, might as well clear them
     * all.
     */
    phy_ppi_wfr_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();
    phy_ppi_radio_address_to_ccm_crypt_disable();

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        dptr = (uint8_t *)&g_ble_phy_enc_buf[0];
        pktptr = (uint8_t *)&g_ble_phy_tx_buf[0];
        NRF_CCM->IN.PTR = (uint32_t)&g_ccm_job_list.in;
        NRF_CCM->OUT.PTR = (uint32_t)&g_ccm_job_list.out;

        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->MODE = CCM_MODE_MODE_Encryption | (CCM_MODE_MACLEN_M4 << CCM_MODE_MACLEN_Pos) | ble_phy_get_ccm_datarate();
    } else {
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
        NRF_AAR->IN.PTR = (uint32_t)&g_nrf_irk_list[0];
#endif
        dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
        pktptr = dptr;
    }
#else
    dptr = (uint8_t *)&g_ble_phy_tx_buf[0];
    pktptr = dptr;
#endif

    /* Set PDU payload */
    payload_len = pducb(&dptr[3], pducb_arg, &hdr_byte);

    /* RAM representation has S0, LENGTH and S1 fields. (3 bytes) */
    dptr[0] = hdr_byte;
    dptr[1] = payload_len;
    dptr[2] = 0;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        /* AAD length */
        g_ccm_job_list.in_alen = 1;
        g_ccm_job_list.in[0].p_buffer = (uint8_t *) &g_ccm_job_list.in_alen;
        g_ccm_job_list.in[0].size = sizeof(g_ccm_job_list.in_alen);
        g_ccm_job_list.in[0].attributes = 11;

        /* Unencrypted message length */
        g_ccm_job_list.in_mlen = payload_len;
        g_ccm_job_list.in[1].p_buffer = (uint8_t *) &g_ccm_job_list.in_mlen;
        g_ccm_job_list.in[1].size = sizeof(g_ccm_job_list.in_mlen);
        g_ccm_job_list.in[1].attributes = 12;

        /* AAD */
        g_ccm_job_list.in[2].p_buffer = (uint8_t *) &dptr[0];
        g_ccm_job_list.in[2].size = 1;
        g_ccm_job_list.in[2].attributes = 13;

        /* Unencrypted message */
        g_ccm_job_list.in[3].p_buffer = (uint8_t *) &dptr[3];
        g_ccm_job_list.in[3].size = payload_len;
        g_ccm_job_list.in[3].attributes = 14;

        /* Job list terminator */
        memset(&g_ccm_job_list.in[4], 0, sizeof(g_ccm_job_list.in[4]));

        /* AAD length */
        g_ccm_job_list.out[0].p_buffer = (uint8_t *) &g_ccm_job_list.out_alen;
        g_ccm_job_list.out[0].size = sizeof(g_ccm_job_list.out_alen);
        g_ccm_job_list.out[0].attributes = 11;

        /* Encrypted message length LSB */
        g_ccm_job_list.out[1].p_buffer = (uint8_t *) &pktptr[1];
        g_ccm_job_list.out[1].size = 1;
        g_ccm_job_list.out[1].attributes = 12;

        /* Encrypted message length MSB */
        g_ccm_job_list.out[2].p_buffer = (uint8_t *) &g_ccm_job_list.out_mlen_msb;
        g_ccm_job_list.out[2].size = sizeof(g_ccm_job_list.out_mlen_msb);
        g_ccm_job_list.out[2].attributes = 12;

        /* AAD */
        g_ccm_job_list.out[3].p_buffer = (uint8_t *) &pktptr[0];
        g_ccm_job_list.out[3].size = 1;
        g_ccm_job_list.out[3].attributes = 13;

        /* Encrypted message */
        g_ccm_job_list.out[4].p_buffer = (uint8_t *) &pktptr[3];
        g_ccm_job_list.out[4].size = payload_len + 4;
        g_ccm_job_list.out[4].attributes = 14;

        /* Job list terminator */
        memset(&g_ccm_job_list.out[5], 0, sizeof(g_ccm_job_list.out[5]));

